"""
Операционные системы (3 курс, 2025 г)
Тема: Разделение ресурсов. Организация критической секции.
В работе необходимо написать 2 программы для реализации критической секции.
Критическую секцию Программы 1 нужно реализовать на семафорах, а Программы 2 – с применением мониторов.
Реализовать вывод на экран информации о попытках зайти в критическую секцию, успешном заходе и выходе из критической секции.
Варианты в словесном описании программы, для которой необходимо реализовать много поточное приложение.
Каждый поток реализует одну сущность из предложенного варианта. Все задания можно свести к классическим задачам синхронизации.

Программа 2: Программа 2: Реализация на мониторах (мьютексы + условные переменные)
"""
